In [1]:
import numpy as np

In [2]:
import pandas as pd

In [ ]:
score=[[1.0,5.0,1],[2.0,np.nan,2],[np.nan,np.nan,3]]

In [7]:
df = pd.DataFrame({'A':[1,2,np.nan],
                 'B':[5.0,np.nan,np.nan],
                 'C':[1,2,3]})

In [15]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
df.dropna(axis=1)
# axis = 0 는 행
# axis = 1 는 열
# Nan이 있는 컬럼을 제외하고
# axis = 0 은 디폴트 값

   C
0  1
1  2
2  3

In [44]:
df.dropna(thresh=1)
# 행 중에 정상적인 것이 1개 이상이면 표시

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [42]:
df.dropna(thresh=2)
# 행 중에 정상적인 것이 2개 이상이면 표시

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [43]:
df.dropna(thresh=3)
# 행 중에 정상적인 것이 3개 이상이면 표시

     A    B  C
0  1.0  5.0  1

In [45]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [46]:
df.fillna(value=4)

     A    B  C
0  1.0  5.0  1
1  2.0  4.0  2
2  4.0  4.0  3

In [48]:
df['A'].fillna(value=df['A'].mean())
# mean 평균

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64